<?php

namespace Database\Seeders;

use App\Models\lesson;
use Illuminate\Database\Seeder;

class SubtopicSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            'الفصل الأول: التيار الكهربى وقانون أوم وقانونا كيرتشوف' => [
                'التعريفات والعلاقات الرياضية',
                'بعض الكميات الفيزيائية التيار الكهربى',
                'المقاومة الكهربية',
                'المقاومة النوعية',
                'قانون أوم',
                'توصيل المقاومات على التوالي والتوازى',
                'قانون أوم للدائرة المغلقة',
                'قانوناً كيرتشوف',
            ],
            'الفصل الثاني: التأثير المغناطيسي والتيار الكهربى' => [
                'شكل وحساب كثافة الفيض المغناطيسي الناشئ عن مرور تيار كهربي في سلك مستقيم',
                'ملف دائرى',
                'ملف لولبي (حلزوني)',
                'القوة المغناطيسية المؤثرة على سلك مستقيم يمر به تيار',
                'القوة المتعادلة بين سلوكين متوازيين',
                'العزم المغناطيسي المؤثر على ملف',
                'أجهزة القياس: جلفانومتر ذو الملف المتحرك',
                'أمبير التيار المستمر',
                'فولتامتر التيار المستمر',
                'الأومميتير',
            ],
            'الفصل الثالث: الحث الكهرومغناطيسي' => [
                'الحث الكهرومغناطيسي وقانون فاراداي',
                'الحث الذاتي',
                'الحث المتبادل بين ملفين',
                'القوة الدافعة الكهربية المستحثة في سلك مستقيم متحرك',
                'قاعدة لنز',
                'قاعدة للمنع',
                'قاعدة ليد اليمني',
                'تطبيقات الحث الكهرومغناطيسي: المواد الكهربي',
                'المحول الكهربي',
                'الموتور',
            ],
            'الفصل الرابع: دوائر التيار المتردد' => [
                'الأمير الحرارى دائرة تحتوى على مقاومة أومية عديمة تحت قفط ومصدر تيار متردد',
                'دائرة تحتوى على ملف حث عدم المقاومة أومية قفط ومصدر تيار متردد',
                'دائرة تحتوى على مكثف ومصدر تيار متردد',
                'دائرة RL على التوالي',
                'دائرة RC على التوالي',
                'دائرة RLC على التوالي',
                'الدائرة المهتزة',
                'دائرة الرنين',
            ],
            'الفصل الخامس: ازدواجية الموجة والجسيم' => [
                'الضوء كموجة',
                'التأثير الكهروضوئي',
                'الضوء كجسيم',
                'ازدواجية الضوء',
                'ازدواجية المادة',
            ],
            'الفصل السادس: الأطياف الذرية' => [
                'أنواع الأطياف',
                'طيف ذرة الهيدروجين',
                'نموذج بور للذرة',
                'مستويات الطاقة الكمية',
                'انتقال الإلكترون بين المستويات',
                'تفسير أطياف الانبعاث والامتصاص',
                'عيوب نموذج بور ',
            ],
            'الفصل السابع: اللليزر' => [
                'مفهوم الليزر',
                ' الانبعاث المحفز',
                'الانبعاث التلقائي',
                'التعداد المعكوس',
                'البيئة الفعالة و التغذية الراجحة البصرية',
                'خصائص ضوء الليزر',
                'تطبيقات الليزر',
            ],
            'الفصل الثامن: الإلكترونيات الحديثة' => [
                'المواد من حيث التوصيل الكهربي',
                'شباه الموصلات النقية',
                'أشباه الموصلات المطعمة',
                'الوصلة الثنائية',
                'الصمام الثنائي (الدايود)',
                'الصمام الباعث للضوء',
            ],
        ];

        foreach ($data as $lessonTitle => $subtopics) {
            $lesson = lesson::where('title', $lessonTitle)->first();

            if ($lesson) {
                foreach ($subtopics as $subtopicTitle) {
                    $lesson->subtopics()->firstOrCreate(['title' => $subtopicTitle]);
                }
            }
        }
    }
}
